FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/КартинкиИФайлы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КартинкиИФайлы</Name>
			<Comment>Универсальный том хранилищ дополнительных данных</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИмяФайла</Name>
					<Comment>Исходное имя файла для сохранения</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСохранения</Name>
					<Comment>Дата сохранения данных объекта</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазмерФайла</Name>
					<Comment>Исходный размер файла</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к файлу / картинке</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Comment>Хранилище данных картинки или файла</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДанныеВоВнешнемФайле</Name>
					<Comment>Признак того, что данные храняться во внешнем файле</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Картинка</Name>
					<Comment>Признак того, что файл являеться картинкой</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник) для которого необходимо реализовать хренение некоторых данных (например картинок)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Опции</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаХранениеШин</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРемонт</v8:Type>
						<v8:Type>cfg:CatalogRef.Модели</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияАвтомобилей</v8:Type>
						<v8:Type>cfg:CatalogRef.Цвета</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаряд</v8:Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТестДрайвов</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
						<v8:Type>cfg:CatalogRef.ТипыСалона</v8:Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>cfg:DocumentRef.СтраховойПолис</v8:Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ВариантыКомплектации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
						<v8:Type>cfg:ExchangePlanRef.ОбменСМобильнымУстройством</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
						<v8:Type>cfg:DocumentRef.АвтоОбъявление</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Comment>Идентификационная строка, разделяющая данные объекта</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Catalogs/ns_ДляБизнеса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ns_ДляБизнеса</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>AdStatus</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdStatus</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AdType</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AdType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AllowEmail</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_AllowEmail</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>AvitoId</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Category</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_Category</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Condition</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ConditionДляБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateBegin</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>DateEnd</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GoodsType</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_GoodsType_ДляБизнеса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Id</Name>
					<Comment>Уникальный идентификатор объявления в вашей базе данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ListingFee</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ns_ListingFee</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>nsDescription</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Title</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>VideoURL</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Выгружать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныОбъявлений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЗаголовка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ns_ШаблоныЗаголовков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/ns_Переопределяемый/Ext/Module.bsl
Функция ПолучитьОписание(Ссылка) Экспорт
	Возврат Ссылка.Комментарий;
КонецФункции

Функция ПолучитьТаблицуЦенНоменклатуры(МассивНоменклатуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	ВидЦен = ns_ОбщегоНазначенияПовтИсп.ПолучитьВидЦены();
	
	ТаблицаЦен = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры,
	|	МАКСИМУМ(ЦеныСрезПоследних.Цена) КАК Цена
	|ИЗ
	|	РегистрСведений.Цены.СрезПоследних(
	|			,
	|			Номенклатура В (&Номенклатура)
	|				И ТипЦен = &ТипЦен) КАК ЦеныСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныСрезПоследних.Номенклатура,
	|	ЦеныСрезПоследних.ХарактеристикаНоменклатуры";
		
	Если ВидЦен = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТипЦен = &ТипЦен", "ИСТИНА");
	Иначе	
		Запрос.УстановитьПараметр("ТипЦен", ВидЦен);
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				ТаблицаЦен.Вставить(Строка(Выборка.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор()), Выборка.Цена);	
			Иначе
				ТаблицаЦен.Вставить(Строка(Выборка.Номенклатура.УникальныйИдентификатор()), Выборка.Цена);	
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;
	
	Возврат ТаблицаЦен;
КонецФункции
 
Функция ПолучитьТаблицуОстатков(СписокНоменклатуры, Склады = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// TODO доделать запрос с учетом резервов
	// ns_ОбщегоНазначенияПовтИсп.ПолучитьНеВыгружатьВРезерве()
		
	ТаблицаОстатков = Новый Соответствие;
	
        УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОстаткиТоваров.Номенклатура КАК Номенклатура,
	|	СУММА(ОстаткиТоваров.КоличествоОстаток) КАК Остаток,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры
	|ИЗ
	|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(, Номенклатура В (&СписокНоменклатуры)) КАК ОстаткиТоваров
	|ГДЕ
	|	ОстаткиТоваров.КоличествоОстаток > 0
	|
	|СГРУППИРОВАТЬ ПО
	|	ОстаткиТоваров.Номенклатура,
	|	ОстаткиТоваров.ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ЗначениеЗаполнено(Выборка.ХарактеристикаНоменклатуры) Тогда
				ТаблицаОстатков.Вставить(Строка(Выборка.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Выборка.ХарактеристикаНоменклатуры.УникальныйИдентификатор()), Выборка.Остаток);	
			Иначе
				ТаблицаОстатков.Вставить(Строка(Выборка.Номенклатура.УникальныйИдентификатор()), Выборка.Остаток);	
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 
	
	Возврат ТаблицаОстатков; 
КонецФункции
 
Процедура ДобавитьКартинкиИзНоменклатуры(Данные, ТаблицаФото) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ns_ОбщегоНазначенияПовтИсп.ПолучитьБратьФотоАвито() Тогда
		Возврат;	
	КонецЕсли; 
	// В случае доработки функционала раскомментировать эту процедуру, код после закомментировать
	// ns_ПереопределяемыйКонтрагент.ДобавитьКартинкиИзНоменклатуры(Данные, ТаблицаФото);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.Данные,
	|	КартинкиИФайлы.Объект
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Картинка = ИСТИНА
	|	И КартинкиИФайлы.Объект = &Объект";
	Запрос.УстановитьПараметр("Объект", Данные.Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если НЕ Выборка.Данные.Получить() = Неопределено Тогда
			НовСтр = ТаблицаФото.Добавить();
			НовСтр.ВладелецФайла = Данные.Номенклатура;
			НовСтр.Ссылка = XMLСтрока(Выборка.Объект) + Строка(Выборка.Идентификатор);
			НовСтр.Расширение = ".jpg";
			НовСтр.ИмяФайла = XMLСтрока(Выборка.Объект) + Строка(Выборка.Идентификатор);
			НовСтр.Хранилище = Выборка.Данные;
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьЗначенияСопоставленныхРеквизитов(ВыделенныеСтроки) Экспорт
	
	ДанныеЗначений = Новый Структура("Номенклатура, ДопРеквизиты", Новый ТаблицаЗначений, Новый ТаблицаЗначений);
	СписокНоменклатуры = Новый Массив;
	Для каждого Стр Из ВыделенныеСтроки Цикл
		СписокНоменклатуры.Добавить(Стр.Номенклатура);
	КонецЦикла; 
	
	ДанныеЗначений.Номенклатура.Колонки.Добавить("Объект");
	ДанныеЗначений.Номенклатура.Колонки.Добавить("СвойствоНаименование");
	ДанныеЗначений.Номенклатура.Колонки.Добавить("Значение");
	
	ДанныеЗначений.ДопРеквизиты.Колонки.Добавить("Объект");
	ДанныеЗначений.ДопРеквизиты.Колонки.Добавить("СвойствоНаименование");
	ДанныеЗначений.ДопРеквизиты.Колонки.Добавить("Значение");
	
	// TODO разобраться с доп реквизитами
	
	Возврат ДанныеЗначений; 
КонецФункции

Процедура ЗаполнитьДопРеквизиты(СписокЗначений) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СвойстваОбъектов.Наименование
	|ИЗ
	|	ПланВидовХарактеристик.СвойстваОбъектов КАК СвойстваОбъектов";
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокЗначений.Добавить(Выборка.Наименование, Выборка.Наименование);
	КонецЦикла; 

КонецПроцедуры

Процедура ЗаполнитьРеквизитыНоменклатуры(СписокЗначений) Экспорт
	Реквизиты = ПолучитьРеквизитыНоменклатурыДляСопоставления();
	Для каждого Стр Из Реквизиты Цикл
		СписокЗначений.Добавить(Стр.Значение, Стр.Представление);
	КонецЦикла; 
КонецПроцедуры

Функция ПолучитьРеквизитыНоменклатурыДляСопоставления()
	
	Реквизиты = Новый СписокЗначений;
	Реквизиты.Добавить("Ссылка", "Ссылка");
	Реквизиты.Добавить("Родитель", "Родитель");
	Реквизиты.Добавить("Код", "Код");
	Реквизиты.Добавить("Наименование", "Наименование");
	Реквизиты.Добавить("Артикул", "Артикул");
	Реквизиты.Добавить("НаименованиеПолное", "Полное наименование");
	Реквизиты.Добавить("Производитель", "Производитель");
	
	Возврат Реквизиты;
КонецФункции
 
Функция ПолучитьХарактеристики(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	ХарактеристикиНоменклатуры = Новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ХарактеристикиНоменклатуры.Добавить(Выборка.Ссылка);
	КонецЦикла; 
	
	Возврат ХарактеристикиНоменклатуры;
КонецФункции
 
Функция ПолучитьТекстЗапроса_ЗапчастиИАксессуары(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ЗапчастиИАксессуары.Ссылка КАК Ссылка,
	|	ЗапчастиИАксессуары.ПометкаУдаления КАК ПометкаУдаления,
	|	ЗапчастиИАксессуары.Родитель КАК Родитель,
	|	ЗапчастиИАксессуары.ЭтоГруппа КАК ЭтоГруппа,
	|	ЗапчастиИАксессуары.Код КАК Код,
	|	ЗапчастиИАксессуары.Наименование КАК Наименование,
	|	ЗапчастиИАксессуары.AdStatus КАК AdStatus,
	|	ЗапчастиИАксессуары.AdType КАК AdType,
	|	ЗапчастиИАксессуары.AllowEmail КАК AllowEmail,
	|	ЗапчастиИАксессуары.AvitoId КАК AvitoId,
	|	ЗапчастиИАксессуары.Brand КАК Brand,
	|	ЗапчастиИАксессуары.Category КАК Category,
	|	ЗапчастиИАксессуары.Condition КАК Condition,
	|	ЗапчастиИАксессуары.DateBegin КАК DateBegin,
	|	ЗапчастиИАксессуары.DateEnd КАК DateEnd,
	|	ЗапчастиИАксессуары.Id КАК Id,
	|	ЗапчастиИАксессуары.ListingFee КАК ListingFee,
	|	ЗапчастиИАксессуары.nsDescription КАК nsDescription,
	|	ЗапчастиИАксессуары.OEM КАК OEM,
	|	ЗапчастиИАксессуары.RimBolts КАК RimBolts,
	|	ЗапчастиИАксессуары.RimBoltsDiameter КАК RimBoltsDiameter,
	|	ЗапчастиИАксессуары.RimDiameter КАК RimDiameter,
	|	ЗапчастиИАксессуары.RimOffset КАК RimOffset,
	|	ЗапчастиИАксессуары.RimType КАК RimType,
	|	ЗапчастиИАксессуары.RimWidth КАК RimWidth,
	|	ЗапчастиИАксессуары.TireAspectRatio КАК TireAspectRatio,
	|	ЗапчастиИАксессуары.TireSectionWidth КАК TireSectionWidth,
	|	ЗапчастиИАксессуары.TireType КАК TireType,
	|	ЗапчастиИАксессуары.Title КАК Title,
	|	ЗапчастиИАксессуары.TypeId КАК TypeId,
	|	ЗапчастиИАксессуары.VideoURL КАК VideoURL,
	|	ЗапчастиИАксессуары.WheelAxle КАК WheelAxle,
	|	ЗапчастиИАксессуары.Артикул КАК Артикул,
	|	ЗапчастиИАксессуары.Выгружать КАК Выгружать,
	|	ЗапчастиИАксессуары.Номенклатура КАК Номенклатура,
	|	ЗапчастиИАксессуары.Шаблон КАК Шаблон,
	|	ЗапчастиИАксессуары.Предопределенный КАК Предопределенный,
	|	ЗапчастиИАксессуары.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	ЗапчастиИАксессуары.Availability КАК Availability,
	|	ЗапчастиИАксессуары.SpeedIndex КАК SpeedIndex,
	|	ЗапчастиИАксессуары.TiresModels КАК TiresModels,
	|	ЗапчастиИАксессуары.RunFlat КАК RunFlat,
	|	ЗапчастиИАксессуары.Homologation КАК Homologation,
	|	ЗапчастиИАксессуары.LoadIndex КАК LoadIndex,
	|	ЗапчастиИАксессуары.Quantity КАК Quantity
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ЗапчастиИАксессуары
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО ЗапчастиИАксессуары.Номенклатура = Остатки.Номенклатура
	|			И ЗапчастиИАксессуары.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция УстановитьВыгружатьПоДокументу(Документ, ИмяСправочника) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Документ = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	МассивUUID = Новый Массив;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		Для каждого Стр Из Документ.Товары Цикл
			Если ЗначениеЗаполнено(Стр.ХарактеристикаНоменклатуры) Тогда
				ID = Строка(Стр.Номенклатура.УникальныйИдентификатор()) + "#" + Строка(Стр.ХарактеристикаНоменклатуры.УникальныйИдентификатор());
			Иначе	
				ID = Строка(Стр.Номенклатура.УникальныйИдентификатор());
			КонецЕсли; 
			МассивUUID.Добавить(ID);
		КонецЦикла; 	 
	КонецЕсли; 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ns_ЗапчастиИАксессуары.Ссылка
	|ИЗ
	|	Справочник.ns_ЗапчастиИАксессуары КАК ns_ЗапчастиИАксессуары
	|ГДЕ
	|	ns_ЗапчастиИАксессуары.Id В(&МассивUUID)";
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "ns_ЗапчастиИАксессуары", ИмяСправочника);
	Запрос.УстановитьПараметр("МассивUUID", МассивUUID);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли; 
	
	Возврат РезультатЗапроса.Выгрузить();
КонецФункции

Функция ПолучитьЗначенияДополнительныхРеквизитов(СписокНоменклатуры) Экспорт
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Объект");
	ТаблицаЗначений.Колонки.Добавить("СвойствоНаименование");
	ТаблицаЗначений.Колонки.Добавить("Значение");

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЗначенияСвойствОбъектов.Объект,
	|	ЗначенияСвойствОбъектов.Свойство.Наименование КАК СвойствоНаименование,
	|	ЗначенияСвойствОбъектов.Значение
	|ИЗ
	|	РегистрСведений.ЗначенияСвойствОбъектов КАК ЗначенияСвойствОбъектов
	|ГДЕ
	|	ЗначенияСвойствОбъектов.Объект В(&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаЗначений = РезультатЗапроса.Выгрузить();
	ТаблицаЗначений.Индексы.Добавить("Объект");
	ТаблицаЗначений.Индексы.Добавить("СвойствоНаименование");
	
	Возврат ТаблицаЗначений; 
КонецФункции

Функция ПолучитьСписокНоменклатурыСКартинками(СписокНоменклатуры) Экспорт

	УстановитьПривилегированныйРежим(Истина);
	
	СписокСКартинками = Новый Соответствие;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КартинкиИФайлы.Идентификатор,
	|	КартинкиИФайлы.Данные,
	|	КартинкиИФайлы.Объект
	|ИЗ
	|	РегистрСведений.КартинкиИФайлы КАК КартинкиИФайлы
	|ГДЕ
	|	КартинкиИФайлы.Картинка = ИСТИНА
	|	И КартинкиИФайлы.Объект В (&СписокНоменклатуры)";
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат СписокСКартинками;
	КонецЕсли; 
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокСКартинками.Вставить(Выборка.Объект, Истина);
	КонецЦикла; 

	Возврат СписокСКартинками;
КонецФункции

Функция ПолучитьТекстЗапроса_БытоваяЭлектроника(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	БытоваяЭлектроника.Ссылка КАК Ссылка,
	|	БытоваяЭлектроника.ПометкаУдаления КАК ПометкаУдаления,
	|	БытоваяЭлектроника.Родитель КАК Родитель,
	|	БытоваяЭлектроника.ЭтоГруппа КАК ЭтоГруппа,
	|	БытоваяЭлектроника.Код КАК Код,
	|	БытоваяЭлектроника.Наименование КАК Наименование,
	|	БытоваяЭлектроника.AdStatus КАК AdStatus,
	|	БытоваяЭлектроника.AllowEmail КАК AllowEmail,
	|	БытоваяЭлектроника.AvitoId КАК AvitoId,
	|	БытоваяЭлектроника.Category КАК Category,
	|	БытоваяЭлектроника.Condition КАК Condition,
	|	БытоваяЭлектроника.DateBegin КАК DateBegin,
	|	БытоваяЭлектроника.DateEnd КАК DateEnd,
	|	БытоваяЭлектроника.Id КАК Id,
	|	БытоваяЭлектроника.ListingFee КАК ListingFee,
	|	БытоваяЭлектроника.nsDescription КАК nsDescription,
	|	БытоваяЭлектроника.Title КАК Title,
	|	БытоваяЭлектроника.GoodsType КАК GoodsType,
	|	БытоваяЭлектроника.VideoURL КАК VideoURL,
	|	БытоваяЭлектроника.Артикул КАК Артикул,
	|	БытоваяЭлектроника.Выгружать КАК Выгружать,
	|	БытоваяЭлектроника.Номенклатура КАК Номенклатура,
	|	БытоваяЭлектроника.Шаблон КАК Шаблон,
	|	БытоваяЭлектроника.Предопределенный КАК Предопределенный,
	|	БытоваяЭлектроника.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	БытоваяЭлектроника.ProductsType КАК ProductsType
	|ИЗ
	|	Справочник.ns_БытоваяЭлектроника КАК БытоваяЭлектроника
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО БытоваяЭлектроника.Номенклатура = Остатки.Номенклатура
	|			И БытоваяЭлектроника.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьТипСклад() Экспорт
	Возврат Новый ОписаниеТипов("СправочникСсылка.СкладыКомпании");
КонецФункции

Функция ПолучитьТипВидыЦен() Экспорт
	Возврат Новый ОписаниеТипов("СправочникСсылка.ТипыЦен");
КонецФункции

Функция ПолучитьСсылкуВидыЦен(Идентификатор) Экспорт
	Если ТипЗнч(Идентификатор) = Тип("Строка") И ЗначениеЗаполнено(Идентификатор) Тогда
		Возврат Справочники.ТипыЦен.ПолучитьСсылку(Новый УникальныйИдентификатор(Идентификатор));
	Иначе
		Возврат Справочники.ТипыЦен.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьТекстЗапроса_ДляДомаИДачи(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ДляДомаИДачи.Ссылка КАК Ссылка,
	|	ДляДомаИДачи.ПометкаУдаления КАК ПометкаУдаления,
	|	ДляДомаИДачи.Родитель КАК Родитель,
	|	ДляДомаИДачи.ЭтоГруппа КАК ЭтоГруппа,
	|	ДляДомаИДачи.Код КАК Код,
	|	ДляДомаИДачи.Наименование КАК Наименование,
	|	ДляДомаИДачи.AdStatus КАК AdStatus,
	|	ДляДомаИДачи.AllowEmail КАК AllowEmail,
	|	ДляДомаИДачи.AvitoId КАК AvitoId,
	|	ДляДомаИДачи.Category КАК Category,
	|	ДляДомаИДачи.Condition КАК Condition,
	|	ДляДомаИДачи.DateBegin КАК DateBegin,
	|	ДляДомаИДачи.DateEnd КАК DateEnd,
	|	ДляДомаИДачи.Id КАК Id,
	|	ДляДомаИДачи.ListingFee КАК ListingFee,
	|	ДляДомаИДачи.nsDescription КАК nsDescription,
	|	ДляДомаИДачи.Title КАК Title,
	|	ДляДомаИДачи.GoodsType КАК GoodsType,
	|	ДляДомаИДачи.VideoURL КАК VideoURL,
	|	ДляДомаИДачи.Артикул КАК Артикул,
	|	ДляДомаИДачи.Выгружать КАК Выгружать,
	|	ДляДомаИДачи.Номенклатура КАК Номенклатура,
	|	ДляДомаИДачи.Шаблон КАК Шаблон,
	|	ДляДомаИДачи.Предопределенный КАК Предопределенный,
	|	ДляДомаИДачи.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	ДляДомаИДачи.GoodsSubType КАК GoodsSubType,
	|	ДляДомаИДачи.Availability КАК Availability
	|ИЗ
	|	Справочник.ns_ДляДомаИДачи КАК ДляДомаИДачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО ДляДомаИДачи.Номенклатура = Остатки.Номенклатура
	|			И ДляДомаИДачи.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьТипыДокументов() Экспорт 
	СписокТипов = Новый Массив;
	СписокТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
    Возврат Новый ОписаниеТипов(СписокТипов); 
КонецФункции

Функция ПолучитьТекстЗапроса_ДляБизнеса(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ДляБизнеса.Ссылка КАК Ссылка,
	|	ДляБизнеса.ПометкаУдаления КАК ПометкаУдаления,
	|	ДляБизнеса.Родитель КАК Родитель,
	|	ДляБизнеса.ЭтоГруппа КАК ЭтоГруппа,
	|	ДляБизнеса.Код КАК Код,
	|	ДляБизнеса.Наименование КАК Наименование,
	|	ДляБизнеса.AdStatus КАК AdStatus,
	|	ДляБизнеса.AllowEmail КАК AllowEmail,
	|	ДляБизнеса.AvitoId КАК AvitoId,
	|	ДляБизнеса.Category КАК Category,
	|	ДляБизнеса.Condition КАК Condition,
	|	ДляБизнеса.DateBegin КАК DateBegin,
	|	ДляБизнеса.DateEnd КАК DateEnd,
	|	ДляБизнеса.Id КАК Id,
	|	ДляБизнеса.ListingFee КАК ListingFee,
	|	ДляБизнеса.nsDescription КАК nsDescription,
	|	ДляБизнеса.Title КАК Title,
	|	ДляБизнеса.GoodsType КАК GoodsType,
	|	ДляБизнеса.VideoURL КАК VideoURL,
	|	ДляБизнеса.Артикул КАК Артикул,
	|	ДляБизнеса.Выгружать КАК Выгружать,
	|	ДляБизнеса.Номенклатура КАК Номенклатура,
	|	ДляБизнеса.Шаблон КАК Шаблон,
	|	ДляБизнеса.Предопределенный КАК Предопределенный,
	|	ДляБизнеса.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка
	|ИЗ
	|	Справочник.ns_ДляБизнеса КАК ДляБизнеса
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО ДляБизнеса.Номенклатура = Остатки.Номенклатура
	|			И ДляБизнеса.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьТекстЗапроса_ХоббиИОтдых(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ХоббиИОтдых.Ссылка КАК Ссылка,
	|	ХоббиИОтдых.ПометкаУдаления КАК ПометкаУдаления,
	|	ХоббиИОтдых.Родитель КАК Родитель,
	|	ХоббиИОтдых.ЭтоГруппа КАК ЭтоГруппа,
	|	ХоббиИОтдых.Код КАК Код,
	|	ХоббиИОтдых.Наименование КАК Наименование,
	|	ХоббиИОтдых.AdStatus КАК AdStatus,
	|	ХоббиИОтдых.AllowEmail КАК AllowEmail,
	|	ХоббиИОтдых.AvitoId КАК AvitoId,
	|	ХоббиИОтдых.Category КАК Category,
	|	ХоббиИОтдых.Condition КАК Condition,
	|	ХоббиИОтдых.DateBegin КАК DateBegin,
	|	ХоббиИОтдых.DateEnd КАК DateEnd,
	|	ХоббиИОтдых.Id КАК Id,
	|	ХоббиИОтдых.ListingFee КАК ListingFee,
	|	ХоббиИОтдых.nsDescription КАК nsDescription,
	|	ХоббиИОтдых.Title КАК Title,
	|	ХоббиИОтдых.GoodsType КАК GoodsType,
	|	ХоббиИОтдых.VideoURL КАК VideoURL,
	|	ХоббиИОтдых.Артикул КАК Артикул,
	|	ХоббиИОтдых.Выгружать КАК Выгружать,
	|	ХоббиИОтдых.Номенклатура КАК Номенклатура,
	|	ХоббиИОтдых.Шаблон КАК Шаблон,
	|	ХоббиИОтдых.Предопределенный КАК Предопределенный,
	|	ХоббиИОтдых.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	ХоббиИОтдых.AdType КАК AdType,
	|	ХоббиИОтдых.VehicleType КАК VehicleType
	|ИЗ
	|	Справочник.ns_ХоббиИОтдых КАК ХоббиИОтдых
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО ХоббиИОтдых.Номенклатура = Остатки.Номенклатура
	|			И ХоббиИОтдых.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьНаименованиеНоменклатуры(Номенклатура) Экспорт
	ЗаголовокИзПолногоНаименования = ns_ОбщегоНазначенияПовтИсп.ПолучитьБратьЗаголовокИзПолногоНаименования();
	Если НЕ ЗаголовокИзПолногоНаименования = Неопределено И ЗаголовокИзПолногоНаименования = Истина Тогда
		Возврат Номенклатура.НаименованиеПолное;
	Иначе	
		Возврат Номенклатура.Наименование;
	КонецЕсли; 
КонецФункции

Функция ПолучитьТекстЗапроса_МотоциклыИМототехника(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	МотоциклыИМототехника.Ссылка КАК Ссылка,
	|	МотоциклыИМототехника.ПометкаУдаления КАК ПометкаУдаления,
	|	МотоциклыИМототехника.Родитель КАК Родитель,
	|	МотоциклыИМототехника.ЭтоГруппа КАК ЭтоГруппа,
	|	МотоциклыИМототехника.Код КАК Код,
	|	МотоциклыИМототехника.Наименование КАК Наименование,
	|	МотоциклыИМототехника.AdStatus КАК AdStatus,
	|	МотоциклыИМототехника.AllowEmail КАК AllowEmail,
	|	МотоциклыИМототехника.AvitoId КАК AvitoId,
	|	МотоциклыИМототехника.Category КАК Category,
	|	МотоциклыИМототехника.Condition КАК Condition,
	|	МотоциклыИМототехника.DateBegin КАК DateBegin,
	|	МотоциклыИМототехника.DateEnd КАК DateEnd,
	|	МотоциклыИМототехника.Id КАК Id,
	|	МотоциклыИМототехника.ListingFee КАК ListingFee,
	|	МотоциклыИМототехника.nsDescription КАК nsDescription,
	|	МотоциклыИМототехника.Title КАК Title,
	|	МотоциклыИМототехника.VideoURL КАК VideoURL,
	|	МотоциклыИМототехника.Артикул КАК Артикул,
	|	МотоциклыИМототехника.Выгружать КАК Выгружать,
	|	МотоциклыИМототехника.Номенклатура КАК Номенклатура,
	|	МотоциклыИМототехника.Шаблон КАК Шаблон,
	|	МотоциклыИМототехника.Предопределенный КАК Предопределенный,
	|	МотоциклыИМототехника.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	МотоциклыИМототехника.VehicleType КАК VehicleType,
	|	МотоциклыИМототехника.MotoType КАК MotoType
	|ИЗ
	|	Справочник.ns_МотоциклыИМототехника КАК МотоциклыИМототехника
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО МотоциклыИМототехника.Номенклатура = Остатки.Номенклатура
	|			И МотоциклыИМототехника.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьТекстЗапроса_ЛичныеВещи(Склад) Экспорт
	
	Текст = 
	"ВЫБРАТЬ
	|	ns_ЛичныеВещи.Ссылка КАК Ссылка,
	|	ns_ЛичныеВещи.ПометкаУдаления КАК ПометкаУдаления,
	|	ns_ЛичныеВещи.Родитель КАК Родитель,
	|	ns_ЛичныеВещи.ЭтоГруппа КАК ЭтоГруппа,
	|	ns_ЛичныеВещи.Код КАК Код,
	|	ns_ЛичныеВещи.Наименование КАК Наименование,
	|	ns_ЛичныеВещи.AdStatus КАК AdStatus,
	|	ns_ЛичныеВещи.AllowEmail КАК AllowEmail,
	|	ns_ЛичныеВещи.AvitoId КАК AvitoId,
	|	ns_ЛичныеВещи.Category КАК Category,
	|	ns_ЛичныеВещи.Condition КАК Condition,
	|	ns_ЛичныеВещи.DateBegin КАК DateBegin,
	|	ns_ЛичныеВещи.DateEnd КАК DateEnd,
	|	ns_ЛичныеВещи.Id КАК Id,
	|	ns_ЛичныеВещи.ListingFee КАК ListingFee,
	|	ns_ЛичныеВещи.nsDescription КАК nsDescription,
	|	ns_ЛичныеВещи.Title КАК Title,
	|	ns_ЛичныеВещи.GoodsType КАК GoodsType,
	|	ns_ЛичныеВещи.VideoURL КАК VideoURL,
	|	ns_ЛичныеВещи.Артикул КАК Артикул,
	|	ns_ЛичныеВещи.Выгружать КАК Выгружать,
	|	ns_ЛичныеВещи.Номенклатура КАК Номенклатура,
	|	ns_ЛичныеВещи.Шаблон КАК Шаблон,
	|	ns_ЛичныеВещи.Предопределенный КАК Предопределенный,
	|	ns_ЛичныеВещи.Характеристика КАК Характеристика,
	|	ЕСТЬNULL(Остатки.Остаток, 0) КАК Остаток,
	|	ВЫРАЗИТЬ(ЛОЖЬ КАК БУЛЕВО) КАК ЕстьКартинка,
	|	ns_ЛичныеВещи.AdType КАК AdType,
	|	ns_ЛичныеВещи.Apparel КАК Apparel,
	|	ns_ЛичныеВещи.ApparelType КАК ApparelType,
	|	ns_ЛичныеВещи.Size КАК Size
	|ИЗ
	|	Справочник.ns_ЛичныеВещи КАК ns_ЛичныеВещи
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура КАК Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|			СУММА(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток) КАК Остаток
	|		ИЗ
	|			РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании = &Склад) КАК ОстаткиТоваровКомпанииОстатки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ОстаткиТоваровКомпанииОстатки.Номенклатура,
	|			ОстаткиТоваровКомпанииОстатки.ХарактеристикаНоменклатуры) КАК Остатки
	|		ПО ns_ЛичныеВещи.Номенклатура = Остатки.Номенклатура
	|			И ns_ЛичныеВещи.Характеристика = Остатки.ХарактеристикаНоменклатуры";
	
	Если НЕ ЗначениеЗаполнено(Склад) Тогда
		Текст = СтрЗаменить(Текст, "СкладКомпании = &Склад", "");	
	КонецЕсли; 
	
	Возврат Текст;
КонецФункции

Функция ПолучитьЗначенияХарактеристикДляШаблона(СписокНоменклатуры) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаЗначений = Новый ТаблицаЗначений;
	ТаблицаЗначений.Колонки.Добавить("Номенклатура");
	ТаблицаЗначений.Колонки.Добавить("Характеристика");
	ТаблицаЗначений.Колонки.Добавить("ЗначениеДляШаблона");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ХарактеристикиНоменклатуры.Владелец КАК Владелец,
	|	ХарактеристикиНоменклатуры.Ссылка КАК ХарактеристикаНоменклатуры
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры";
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат ТаблицаЗначений;
	КонецЕсли; 
	
	ТаблицаХарактеристик = РезультатЗапроса.Выгрузить();
	
	Для каждого Ссылка Из СписокНоменклатуры Цикл
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Владелец", Ссылка);
		МассивХарактеристик = ТаблицаХарактеристик.НайтиСтроки(ПараметрыОтбора);
		Для каждого Характеристика Из МассивХарактеристик Цикл
			НовСтр = ТаблицаЗначений.Добавить();
			НовСтр.Номенклатура = Ссылка;
			НовСтр.Характеристика = Характеристика.ХарактеристикаНоменклатуры;
			НовСтр.ЗначениеДляШаблона = СформироватьШаблонДляХарактеристики(Характеристика.ХарактеристикаНоменклатуры);
		КонецЦикла; 
	КонецЦикла; 
	
	Возврат ТаблицаЗначений;
КонецФункции

Функция СформироватьШаблонДляХарактеристики(ХарактеристикаНоменклатуры) Экспорт
	//Возврат ns_ПереопределяемыйКонтрагент.СформироватьШаблонДляХарактеристики(ХарактеристикаНоменклатуры);
	Возврат Строка(ХарактеристикаНоменклатуры);
КонецФункции
